Tekla.Structures.Geometry3d.StructuresExtensions
The Tekla.Structures.Geometry3d.StructuresExtensions class provides a set of extension methods
for types in the Tekla.Structures.Geometry3d namespace.

Tekla.Structures.Geometry3d.StructuresExtensions.CopyCoordinates(Tekla.Structures.Geometry3d.Point,Tekla.Common.Geometry.Vector3)
Copies the coordinates from the Tekla.Common.Geometry.Vector3 to the target Tekla.Structures.Geometry3d.Point.
target: The Tekla.Structures.Geometry3d.Point to copy the coordinates to.
vector: The Tekla.Common.Geometry.Vector3 to copy the coordinates from.

Tekla.Structures.Geometry3d.StructuresExtensions.CopyCoordinates(Tekla.Structures.Geometry3d.Vector,Tekla.Common.Geometry.Vector3)
Copies the coordinates from the Tekla.Common.Geometry.Vector3 to the target Tekla.Structures.Geometry3d.Vector.
target: The Tekla.Structures.Geometry3d.Vector to copy the coordinates to.
vector: The Tekla.Common.Geometry.Vector3 to copy the coordinates from.

Tekla.Structures.Geometry3d.StructuresExtensions.Translate(System.Collections.ArrayList,Tekla.Common.Geometry.Vector3)
Translates the contourPoints by the translation vector.
contourPoints: The contour points.
translation: The translation vector to apply.
Throws System.ArgumentNullException: contourPoints